
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 1 to change, 5 to destroy.</code></pre>

* Update
  * azurerm_resource_group.rg
* Replace
  * azurerm_key_vault_secret.local_app_insights_connection_string
  * azurerm_key_vault_secret.local_app_insights_key
  * azurerm_key_vault_secret.local_docmosis_access_key
  * azurerm_key_vault_secret.local_docmosis_templates_auth
  * azurerm_key_vault_secret.local_s2s_key


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault.local_key_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "local_key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "dg-docassembly-aat"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + rbac_authorization_enabled      = (known after apply)
      + resource_group_name             = "dg-docassembly-aat"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # azurerm_key_vault_secret.local_app_insights_connection_string must be replaced
-/+ resource "azurerm_key_vault_secret" "local_app_insights_connection_string" {
      ~ id                      = "https://dg-docassembly-aat.vault.azure.net/secrets/app-insights-connection-string/dd9e6920ff344fce8bbb2360f23ce2ec" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dg-docassembly-aat/providers/Microsoft.KeyVault/vaults/dg-docassembly-aat" -> (known after apply) # forces replacement
        name                    = "app-insights-connection-string"
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dg-docassembly-aat/providers/Microsoft.KeyVault/vaults/dg-docassembly-aat/secrets/app-insights-connection-string/versions/dd9e6920ff344fce8bbb2360f23ce2ec" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dg-docassembly-aat/providers/Microsoft.KeyVault/vaults/dg-docassembly-aat/secrets/app-insights-connection-string" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "dd9e6920ff344fce8bbb2360f23ce2ec" -> (known after apply)
      ~ versionless_id          = "https://dg-docassembly-aat.vault.azure.net/secrets/app-insights-connection-string" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.local_app_insights_key must be replaced
-/+ resource "azurerm_key_vault_secret" "local_app_insights_key" {
      ~ id                      = "https://dg-docassembly-aat.vault.azure.net/secrets/AppInsightsInstrumentationKey/dedd833b270241a38654f0cf1bb6568c" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dg-docassembly-aat/providers/Microsoft.KeyVault/vaults/dg-docassembly-aat" -> (known after apply) # forces replacement
        name                    = "AppInsightsInstrumentationKey"
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dg-docassembly-aat/providers/Microsoft.KeyVault/vaults/dg-docassembly-aat/secrets/AppInsightsInstrumentationKey/versions/dedd833b270241a38654f0cf1bb6568c" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dg-docassembly-aat/providers/Microsoft.KeyVault/vaults/dg-docassembly-aat/secrets/AppInsightsInstrumentationKey" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "dedd833b270241a38654f0cf1bb6568c" -> (known after apply)
      ~ versionless_id          = "https://dg-docassembly-aat.vault.azure.net/secrets/AppInsightsInstrumentationKey" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.local_docmosis_access_key must be replaced
-/+ resource "azurerm_key_vault_secret" "local_docmosis_access_key" {
      ~ id                      = "https://dg-docassembly-aat.vault.azure.net/secrets/docmosis-access-key/08587151d0d24cecbbf5615b5cc9d30e" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dg-docassembly-aat/providers/Microsoft.KeyVault/vaults/dg-docassembly-aat" -> (known after apply) # forces replacement
        name                    = "docmosis-access-key"
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dg-docassembly-aat/providers/Microsoft.KeyVault/vaults/dg-docassembly-aat/secrets/docmosis-access-key/versions/08587151d0d24cecbbf5615b5cc9d30e" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dg-docassembly-aat/providers/Microsoft.KeyVault/vaults/dg-docassembly-aat/secrets/docmosis-access-key" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "08587151d0d24cecbbf5615b5cc9d30e" -> (known after apply)
      ~ versionless_id          = "https://dg-docassembly-aat.vault.azure.net/secrets/docmosis-access-key" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.local_docmosis_templates_auth must be replaced
-/+ resource "azurerm_key_vault_secret" "local_docmosis_templates_auth" {
      ~ id                      = "https://dg-docassembly-aat.vault.azure.net/secrets/docmosis-templates-auth/e430b30edd9344bf892c53d1ef204650" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dg-docassembly-aat/providers/Microsoft.KeyVault/vaults/dg-docassembly-aat" -> (known after apply) # forces replacement
        name                    = "docmosis-templates-auth"
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dg-docassembly-aat/providers/Microsoft.KeyVault/vaults/dg-docassembly-aat/secrets/docmosis-templates-auth/versions/e430b30edd9344bf892c53d1ef204650" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dg-docassembly-aat/providers/Microsoft.KeyVault/vaults/dg-docassembly-aat/secrets/docmosis-templates-auth" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "e430b30edd9344bf892c53d1ef204650" -> (known after apply)
      ~ versionless_id          = "https://dg-docassembly-aat.vault.azure.net/secrets/docmosis-templates-auth" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.local_s2s_key must be replaced
-/+ resource "azurerm_key_vault_secret" "local_s2s_key" {
      ~ id                      = "https://dg-docassembly-aat.vault.azure.net/secrets/microservicekey-dg-docassembly-api/f3bf744465a04ea4bc2f1c2ff0a1aa95" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dg-docassembly-aat/providers/Microsoft.KeyVault/vaults/dg-docassembly-aat" -> (known after apply) # forces replacement
        name                    = "microservicekey-dg-docassembly-api"
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dg-docassembly-aat/providers/Microsoft.KeyVault/vaults/dg-docassembly-aat/secrets/microservicekey-dg-docassembly-api/versions/f3bf744465a04ea4bc2f1c2ff0a1aa95" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dg-docassembly-aat/providers/Microsoft.KeyVault/vaults/dg-docassembly-aat/secrets/microservicekey-dg-docassembly-api" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "f3bf744465a04ea4bc2f1c2ff0a1aa95" -> (known after apply)
      ~ versionless_id          = "https://dg-docassembly-aat.vault.azure.net/secrets/microservicekey-dg-docassembly-api" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dg-docassembly-aat"
        name       = "dg-docassembly-aat"
        tags       = {
            "application"         = "evidence-management"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/dg-docassembly-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#em-dev-chat"
            "environment"         = "staging"
            "managedBy"           = "Evidence Management"
        }
        # (2 unchanged attributes hidden)

      - timeouts {}
    }

Plan: 5 to add, 1 to change, 5 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2276,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->